veneno-529/RIOT/cpu/stm32/stmclk/stmclk_h7.c
#if (CONFIG_CLOCK_MCO1_PRE >= 1) && (CONFIG_CLOCK_MCO1_PRE <= 16)
#define CLOCK_MCO1_PRE  (((CONFIG_CLOCK_MCO1_PRE - 1) & 0xF) << RCC_CFGR_MCO1PRE_Pos)
#else
#error "Invalid MCO1 prescaler"
#endif


/* Default is not configure MCO2 */
#ifndef CONFIG_CLOCK_ENABLE_MCO2
#define CONFIG_CLOCK_ENABLE_MCO2        0
#endif

#if !defined(RCC_CFGR_MCO2) && IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2)
#error "stmclk: no MCO2 on this device"
#endif

/* Configure the MCO1 clock source: options are PLL1_P (default),PLL2_P, SYSCLK, LSI, CSI or HSE */
#ifndef CONFIG_CLOCK_MCO2_USE_PLL1_P
#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK)
#define CONFIG_CLOCK_MCO2_USE_PLL1_P   0
#else
#define CONFIG_CLOCK_MCO2_USE_PLL1_P   1     /* Use PLL by default */
#endif
#endif /* CONFIG_CLOCK_MCO2_USE_PLL1 */

#ifndef CONFIG_CLOCK_MCO2_USE_PLL2_Q
#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK)
#define CONFIG_CLOCK_MCO2_USE_PLL2   0
#else
#define CONFIG_CLOCK_MCO2_USE_PLL2_P   1     /* Use PLL by default */
#endif
#endif /* CONFIG_CLOCK_MCO2_USE_PLL2 */

#ifndef CONFIG_CLOCK_MCO2_USE_HSE
#define CONFIG_CLOCK_MCO2_USE_HSE   0
#endif /* CONFIG_CLOCK_MCO2_USE_HSE */

#ifndef CONFIG_CLOCK_MCO2_USE_LSI
#define CONFIG_CLOCK_MCO2_USE_LSI   0
#endif /* CONFIG_CLOCK_MCO2_USE_HSI */

#ifndef CONFIG_CLOCK_MCO2_USE_CSI
#define CONFIG_CLOCK_MCO2_USE_CSI   0
#endif /* CONFIG_CLOCK_MCO2_USE_HSI */

#ifndef CONFIG_CLOCK_MCO2_USE_SYSCLK
#define CONFIG_CLOCK_MCO2_USE_SYSCLK   0
#endif /* CONFIG_CLOCK_MCO2_USE_SYSCLK */


#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use PLL1_P as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use HSE as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use CSI as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI) || IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL2_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use LSI as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK))
#error "Cannot use PLL2_P as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK) && \
    (IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSI) || IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI) || \
     IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P))
#error "Cannot use SYSCLK as MCO2 clock source with other clock"
#endif

#if IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_SYSCLK)
#define CLOCK_MCO2_SRC                          (0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_0) 
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_1)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_1 | RCC_CFGR_MCO2_0)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_2)
#elif IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI)
#define CLOCK_MCO2_SRC                          (RCC_CFGR_MCO2_2 | RCC_CFGR_MCO2_0)
#else
#error "Invalid MCO2 clock source selection"
#endif

/* Configure the MCO1 prescaler: options are 1 to 5 */
#ifndef CONFIG_CLOCK_MCO2_PRE
#define CONFIG_CLOCK_MCO2_PRE           (1)
#endif

#if (CONFIG_CLOCK_MCO2_PRE >= 1) && (CONFIG_CLOCK_MCO2_PRE <= 16)
#define CLOCK_MCO2_PRE  (((CONFIG_CLOCK_MCO2_PRE - 1) & 0xF) << RCC_CFGR_MCO2PRE_Pos)
#else
#error "Invalid MCO2 prescaler"
#endif

/* Check whether PLL1 must be enabled:
  - When PLL1 is used as SYSCLK
  - When PLL1 is required (PLL1_P/PLL1_Q/PLL1R)
  - When PLL1_P is used as input source for MCO1 or MCO2
*/
#if IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
    IS_ACTIVE(CONFIG_USE_CSI_PLL) || (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL1_P)) 
#define CLOCK_ENABLE_PLL1_P               1
#pragma message ("ENABLED PLL1_P")
#else
#define CLOCK_ENABLE_PLL1_P               0
#endif

#if IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
    IS_ACTIVE(CONFIG_USE_CSI_PLL) || IS_ACTIVE(CLOCK_REQUIRE_PLL1_Q) || \
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_PLL1_Q))
#define CLOCK_ENABLE_PLL1_Q                1
#pragma message ("ENABLED PLL1_Q")
#else
#define CLOCK_ENABLE_PLL1_Q                0
#endif


/* Check whether PLL2 must be enabled:
  - When PLL2 is required (PLL2_P/PLL2_Q/PLL2_R)
  - When PLL2 is used as input source for MCO1 or MCO2
*/
#if IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
    IS_ACTIVE(CONFIG_USE_CSI_PLL) || (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && \
    IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_PLL2_P))
#define CLOCK_ENABLE_PLL2_P                1
#pragma message ("ENABLED PLL2_P")
#else
#define CLOCK_ENABLE_PLL2_P                0
#endif

#if IS_ACTIVE(CLOCK_REQUIRE_PLL2_R)
#define CLOCK_ENABLE_PLL2_R                1
#pragma message ("ENABLED PLL2_R")
#else
#define CLOCK_ENABLE_PLL2_R                0
#endif

