veneno-529/RIOT/cpu/stm32/stmclk/stmclk_h7.c
/* Check whether PLL3 must be enabled :
  - When PLL3 is required*/
#if  IS_ACTIVE(CLOCK_REQUIRE_PLL3_Q)
#define CLOCK_ENABLE_PLL3_Q                1
#pragma message ("ENABLED PLL3_1Q")
#else
#define CLOCK_ENABLE_PLL3_Q                0
#endif

/* Check whether HSE must be enabled:
  - When HSE is used as SYSCLK
  - When PLL1 is used as SYSCLK and the board provides HSE (since HSE will be
    used as PLL1 input clock)
  - When HSE is used input source for MCO1 or MCO2
*/
#if IS_ACTIVE(CONFIG_USE_HSE_PLL) || IS_ACTIVE(CONFIG_USE_HSE_DIRECT) ||\
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSE)) ||\
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_HSE))
#define CLOCK_ENABLE_HSE                1
#pragma message ("ENABLE HSE")
#else
#define CLOCK_ENABLE_HSE                0
#endif

/* Check whether HSI must be enabled:
  - When HSI is used as SYSCLK
  - When PLL1 is used as SYSCLK and the board doesn't provide HSE (since HSI will be
    used as PLL1 input clock)
  - When HSI is used input source for MCO1
*/
#if IS_ACTIVE(CONFIG_USE_HSI_DIRECT) || IS_ACTIVE(CONFIG_USE_HSI_PLL) ||\
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI))
#define CLOCK_ENABLE_HSI                1
#pragma message ("ENABLE HSI")
#else
#define CLOCK_ENABLE_HSI                0
#endif

#if IS_ACTIVE(CONFIG_USE_CSI_DIRECT) || IS_ACTIVE(CONFIG_USE_CSI_PLL) ||\
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_CSI))
#define CLOCK_ENABLE_CSI                1
#pragma message ("ENABLE CSI")
#else
#define CLOCK_ENABLE_CSI                0
#endif

#if IS_ACTIVE(CONFIG_USE_LSI) ||\
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2) && IS_ACTIVE(CONFIG_CLOCK_MCO2_USE_LSI))
#define CLOCK_ENABLE_LSI                1
#pragma message ("ENABLE LSI")
#else
#define CLOCK_ENABLE_LSI                0
#endif

#if IS_ACTIVE(CONFIG_USE_LSE) ||\
    (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_LSE))
#define CLOCK_ENABLE_LSE                1
#pragma message ("ENABLE LSE")
#else
#define CLOCK_ENABLE_LSE                0
#endif    

#if (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1) && IS_ACTIVE(CONFIG_CLOCK_MCO1_USE_HSI48)) ||\
    IS_ACTIVE(CLOCK_REQUIRE_HSI48)    
#define CLOCK_ENABLE_HSI48              1
#pragma message ("ENABLE HSI48")
#else
#define CLOCK_ENABLE_HSI48              0
#endif

#if ! ( (defined(CONFIG_USE_HSI_PLL) && (CONFIG_USE_HSI_PLL)) || \
    (defined(CONFIG_USE_HSE_PLL) && (CONFIG_USE_HSE_PLL)) || \
    (defined(CONFIG_USE_CSI_PLL) && (CONFIG_USE_CSI_PLL)) || \
    (defined(CONFIG_USE_HSI_DIRECT) && (CONFIG_USE_HSI_DIRECT)) || \
    (defined(CONFIG_USE_HSE_DIRECT) && (CONFIG_USE_HSE_DIRECT)) || \
    (defined(CONFIG_USE_CSI_DIRECT) && (CONFIG_USE_CSI_DIRECT)) )
#error "No valid SYSCLK source selected: enable one of CONFIG_USE_* in your board config"
#endif

void stmclk_init_sysclk(void)
{
    /* disable any interrupts. Global interrupts could be enabled if this is
     * called from some kind of bootloader...  */
    unsigned is = irq_disable();
    RCC->CR = 0;
    //RCC->CICR = 0;

    /* enable HSI clock for the duration of initialization */
    stmclk_enable_hsi();

    /* use HSI as system clock while we do any further configuration and
     * configure the AHB and APB clock dividers as configure by the board */
    RCC->D1CFGR = CLOCK_CORECLOCK_DIV | CLOCK_AHB_DIV | CLOCK_APB3_DIV;
    RCC->D2CFGR = CLOCK_APB1_DIV | CLOCK_APB2_DIV;
    RCC->D3CFGR = CLOCK_APB4_DIV;

    /* use HSI as system clock while we do any further configuration and
     * configure the AHB and APB clock dividers as configure by the board */
    RCC->CFGR = (RCC_CFGR_SW_HSI);
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI) {}

#if 1
    /* Flash config */
    //FLASH->ACR = FLASH_ACR_CONFIG;
    FLASH->ACR = FLASH_ACR_LATENCY_7WS;

    // enable internal LDO power supply
    PWR->CR3 |= PWR_CR3_LDOEN;
    while (!(PWR->CSR1 & PWR_CSR1_ACTVOSRDY)) {}

#if (CLOCK_CORECLOCK > MHZ(400)) 
    /* Configuring VOS0 mode for max frequency 480MHz*/
    // set voltage scaling to scale 1 mode 
    PWR->D3CR = (PWR->D3CR & ~PWR_D3CR_VOS_Msk) | (PWR_D3CR_VOS_0 | PWR_D3CR_VOS_1);
    while (!(PWR->D3CR & PWR_D3CR_VOSRDY)) {}

    // Enable SYSCFG clock
    RCC->APB4ENR |= RCC_APB4ENR_SYSCFGEN;
    // Enbale Over-Drive to enter VOS0 mode
    SYSCFG->PWRCR |= SYSCFG_PWRCR_ODEN;
    while (!(PWR->D3CR & PWR_D3CR_VOSRDY)) {}
    #pragma message ("VOS0 with Over-Drive ENABLED")

#elif (CLOCK_CORECLOCK > MHZ(300) && CLOCK_CORECLOCK <= MHZ(400))
    /* Configuring VOS0 mode for up to 400MHz frequency */
    // set voltage scaling to scale 1 mode 
    PWR->D3CR = (PWR->D3CR & ~PWR_D3CR_VOS_Msk) | (PWR_D3CR_VOS_0 | PWR_D3CR_VOS_1);
    while (!(PWR->D3CR & PWR_D3CR_VOSRDY)) {}
    #pragma message ("VOS1 ENABLED")

#elif (CLOCK_CORECLOCK > MHZ(200) && CLOCK_CORECLOCK <= MHZ(300))
    /* Configuring VOS1 mode for up to 180MHz frequency */
    // set voltage scaling to scale 2 mode 
    PWR->D3CR = (PWR->D3CR & ~PWR_D3CR_VOS_Msk) | (PWR_D3CR_VOS_1);
    while (!(PWR->D3CR & PWR_D3CR_VOSRDY)) {}   
    #pragma message ("VOS2 ENABLED")
#else
    /* Configuring VOS2 mode for up to 200MHz frequency */
    // set voltage scaling to scale 3 mode 
    PWR->D3CR = (PWR->D3CR & ~PWR_D3CR_VOS_Msk) | (PWR_D3CR_VOS_0);
    while (!(PWR->D3CR & PWR_D3CR_VOSRDY)) {}
    #pragma message ("VOS3 ENABLED")

#endif  

    /* disable all active clocks except HSI -> resets the clk configuration */
    RCC->CR = (RCC_CR_HSION | RCC_CR_HSIDIV_1);

    #if (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO1)) 
        RCC->CFGR |= CLOCK_MCO1_SRC | CLOCK_MCO1_PRE;

        /* Configure GPIO pin (PA8/AF0) */
        gpio_init(GPIO_PIN(PORT_A, 8), GPIO_OUT);
        gpio_init_af(GPIO_PIN(PORT_A, 8), GPIO_AF0);
    #endif
    #if (IS_ACTIVE(CONFIG_CLOCK_ENABLE_MCO2)) 
        RCC->CFGR |= CLOCK_MCO2_SRC | CLOCK_MCO2_PRE;

        /* Configure GPIO pin (PC9/AF0) */
        gpio_init(GPIO_PIN(PORT_C, 9), GPIO_OUT);
        gpio_init_af(GPIO_PIN(PORT_C, 9), GPIO_AF0);
    #endif
#endif

    /* Enable HSE if required */
    #if (IS_ACTIVE(CLOCK_ENABLE_HSE))
        //RCC->CR |= (RCC_CR_HSEBYP); //TODO
        RCC->CR |= (RCC_CR_HSEON);
        while (!(RCC->CR & RCC_CR_HSERDY)) {}
        #pragma message ("HSE ACTIVE NOW")
    #endif
    /* Enable LSE if required */
    #if(IS_ACTIVE(CLOCK_ENABLE_LSE))
        RCC->BDCR |= RCC_BDCR_LSEON;
        while (!(RCC->BDCR & RCC_BDCR_LSERDY)) {}
        #pragma message ("LSE ACTIVE NOW")
    #endif
    /* Enable HSI if required */
    #if(IS_ACTIVE(CLOCK_ENABLE_CSI))
        RCC->CR |= RCC_CR_CSION;
        while (!(RCC->CR & RCC_CR_CSIRDY)) {}
        #pragma message ("CSI ACTIVE NOW")
    #endif
    /* Enable LSI if required */ 
    #if(IS_ACTIVE(CLOCK_ENABLE_LSI))
        RCC->CSR |= RCC_CSR_LSION;
        while (!(RCC->CSR & RCC_CSR_LSIRDY)) {}
        #pragma message ("LSI ACTIVE NOW")
    #endif

    /* Enable HSI48 if required */
    #if(IS_ACTIVE(CLOCK_ENABLE_HSI48)) 
        RCC->CR |= RCC_CR_HSI48ON;
        while (!(RCC->CR & RCC_CR_HSI48RDY)) {}
        #pragma message ("HSI48 ACTIVE NOW")
    #endif
    /* Enable PLL if required */
    #if (IS_ACTIVE(CONFIG_USE_HSI_PLL) || IS_ACTIVE(CONFIG_USE_HSE_PLL) || \
         IS_ACTIVE(CONFIG_USE_CSI_PLL)) 
        //TODO set fraction to 0?
         /* now we can safely configure and start the PLL */
        RCC->PLLCKSELR = (PLL1_SRC | PLL1_M | PLL2_M | PLL3_M);
        RCC->PLLCFGR =
            ( RCC_PLLCFGR_PLL1RGE_3 // search datasheet for PLL1RGE
            //| RCC_PLLCFGR_PLL1VCOSEL
            | RCC_PLLCFGR_PLL2RGE_3 // search datasheet for PLL2RGE
            //| RCC_PLLCFGR_PLL2VCOSEL
            | RCC_PLLCFGR_PLL3RGE_3 // search datasheet for PLL3RGE
            //| RCC_PLLCFGR_PLL3VCOSEL
            // by default enabling all outputs, can be disabled later if not used
            | RCC_PLLCFGR_DIVP1EN
            | RCC_PLLCFGR_DIVQ1EN
            | RCC_PLLCFGR_DIVR1EN
            | RCC_PLLCFGR_DIVP2EN
            | RCC_PLLCFGR_DIVQ2EN 
            | RCC_PLLCFGR_DIVR2EN
            | RCC_PLLCFGR_DIVP3EN
            | RCC_PLLCFGR_DIVQ3EN
            | RCC_PLLCFGR_DIVR3EN
            );
        //RCC->PLL1FRACEN = 0;
        //RCC->PLL1FRACR |= RCC_PLL1FRACR_FRACN1;
        RCC->PLL1DIVR = (PLL1_N | PLL1_P | PLL1_Q | PLL1_R);
        RCC->CR |= RCC_CR_PLL1ON;
        while (!(RCC->CR & RCC_CR_PLL1RDY)) {}
        RCC->PLL2DIVR = (PLL2_N | PLL2_P | PLL2_Q | PLL2_R);
        RCC->CR |= RCC_CR_PLL2ON;
        while (!(RCC->CR & RCC_CR_PLL2RDY)) {} 
        RCC->PLL3DIVR = (PLL3_N | PLL3_P | PLL3_Q | PLL3_R);
        RCC->CR |= RCC_CR_PLL3ON;
        while (!(RCC->CR & RCC_CR_PLL3RDY)) {}
        RCC->CR |= (RCC_CR_PLLON);
        while (!(RCC->CR & RCC_CR_PLLRDY)) {}
        #pragma message ("PLLs ACTIVE NOW")
    #endif
    /* Configure SYSCLK (preprocessor selection: only the chosen branch is
     * compiled). We prefer explicit DIRECT selections from the generated
     * configuration over defaulted PLL macros, so DIRECT options are tested
     * first. */
    #if (defined(CONFIG_USE_HSI_DIRECT) && (CONFIG_USE_HSI_DIRECT))
        /* Enable HSI as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_HSI);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSI) {}
        #pragma message("Configured HSI as system clock (direct)")
    #elif (defined(CONFIG_USE_HSE_DIRECT) && (CONFIG_USE_HSE_DIRECT) ||\
           (defined(CONFIG_USE_HSE_PLL) && (CONFIG_USE_HSE_PLL)))
        /* Enable HSE as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_HSE);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_HSE) {}
        #pragma message("Configured HSE as system clock (direct)")
        RCC->PLLCKSELR |= RCC_PLLCKSELR_PLLSRC_HSE;
        #if defined(CONFIG_USE_HSE_PLL) && (CONFIG_USE_HSE_PLL)
            /* Enable PLL1P as system clock */
            RCC->CFGR |= (RCC_CFGR_SW_PLL1);
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL1) {}
            #pragma message("Configured PLL as system clock")
        #endif
    #elif (defined(CONFIG_USE_CSI_DIRECT) && (CONFIG_USE_CSI_DIRECT) ||\
          (defined(CONFIG_USE_CSI_PLL) && (CONFIG_USE_CSI_PLL)))
        /* Enable CSI as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_CSI);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_CSI) {}
        #pragma message("Configured CSI as system clock (direct)")
        RCC->PLLCKSELR |= RCC_PLLCKSELR_PLLSRC_CSI;
        #if (defined(CONFIG_USE_CSI_PLL) && (CONFIG_USE_CSI_PLL))
            /* Enable PLL1P as system clock */
            RCC->CFGR |= (RCC_CFGR_SW_PLL1);
            while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL1) {}
            #pragma message("Configured PLL as system clock")
        #endif
    #elif (defined(CONFIG_USE_HSI_PLL) && (CONFIG_USE_HSI_PLL))
        /* Enable PLL1P as system clock */
        RCC->CFGR |= (RCC_CFGR_SW_PLL1);
        while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL1) {}
        #pragma message("Configured PLL as system clock")
    #else
        /* No valid SYSCLK branch selected at preprocess time. This should be
         * caught by the compile-time guard above; however keep a runtime trap
         * in case this ever runs on a configuration that slipped through. */
        while (1) {}
    #endif

    irq_restore(is);
}
